---
type: WireframeBuilder
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# WireframeBuilder

`Autodesk.Revit.DB.WireframeBuilder` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | WireframeBuilder | 2016 | `public WireframeBuilder ()` |
| Method | AddCurve | 2016 | `public void AddCurve ( Curve GCurve )` |
| Method | AddPoint | 2016 | `public void AddPoint ( Point GPoint )` |
| Method | Reset | 2016 | `public void Reset ()` |
| Method | ValidateCurve | 2016 | `public static bool ValidateCurve ( Curve GCurve )` |
| Method | ValidatePoint | 2016 | `public static bool ValidatePoint ( Point GPoint )` |